In [4]:
import pandas as pd
data = pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],
                    'data':[4,3,2,1,12,3,4,5,7]})
data

  group  data
0     a     4
1     a     3
2     a     2
3     b     1
4     b    12
5     b     3
6     c     4
7     c     5
8     c     7

### 排序

In [5]:
data2 = data.sort_values(by=['group','data'],ascending = [False,True],inplace=False)
data2

  group  data
6     c     4
7     c     5
8     c     7
3     b     1
5     b     3
4     b    12
2     a     2
1     a     3
0     a     4

In [6]:
data

  group  data
0     a     4
1     a     3
2     a     2
3     b     1
4     b    12
5     b     3
6     c     4
7     c     5
8     c     7

In [7]:
data.sort_values(by='data')

  group  data
3     b     1
2     a     2
1     a     3
5     b     3
0     a     4
6     c     4
7     c     5
8     c     7
4     b    12

### 去重

In [8]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,
                   'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [12]:
data.drop_duplicates()

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [15]:
data.drop_duplicates(subset='k1')

    k1  k2
0  one   3
3  two   3

### 创建列

In [44]:
import numpy as np
df = pd.DataFrame({'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})
df2 = df.assign(ration = df['data1']/df['data2'])
df2

      data1     data2     ration
0  0.789029  0.020697  38.123470
1 -1.721702 -1.267728   1.358100
2  1.183887  0.245880   4.814905
3 -0.807332  1.215616  -0.664134
4  0.638771 -0.126562  -5.047096

### 删除列

In [45]:
df2.drop('ration',axis='columns',inplace=True)
df2

      data1     data2
0  0.789029  0.020697
1 -1.721702 -1.267728
2  1.183887  0.245880
3 -0.807332  1.215616
4  0.638771 -0.126562

In [46]:
data = pd.Series([1,2,3,4,5,6,7,8,9])
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

### 替换

In [47]:
data.replace(9,np.nan,inplace=True)
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
8    NaN
dtype: float64

### 切分

In [48]:
ages = [15,18,20,21,22,34,41,52,63,79]
bins = [10,40,80]
bins_res = pd.cut(ages,bins)
bins_res

[(10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (40, 80], (40, 80], (40, 80], (40, 80]]
Categories (2, interval[int64, right]): [(10, 40] < (40, 80]]

In [53]:
pd.value_counts(bins_res)

(10, 40]    6
(40, 80]    4
Name: count, dtype: int64

In [55]:
group_names = ['Yonth','Mille','Old']
bins = [10,30,50,80]
bins_res = pd.cut(ages,bins,labels=group_names)
bins_res

['Yonth', 'Yonth', 'Yonth', 'Yonth', 'Yonth', 'Mille', 'Mille', 'Old', 'Old', 'Old']
Categories (3, object): ['Yonth' < 'Mille' < 'Old']

In [56]:
pd.value_counts(bins_res)

Yonth    5
Old      3
Mille    2
Name: count, dtype: int64

### 判空

In [57]:
df = pd.DataFrame([range(3),[0, np.nan,0],[0,0,np.nan],range(3)])
df

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [58]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [60]:
df.isnull().any(axis=1)

0    False
1     True
2     True
3    False
dtype: bool

### 填充缺失值

In [62]:
df.fillna(9)

   0    1    2
0  0  1.0  2.0
1  0  9.0  0.0
2  0  0.0  9.0
3  0  1.0  2.0

#### 利用缺失值bool做索引

In [63]:
df[df.isnull().any(axis=1)]

   0    1    2
1  0  NaN  0.0
2  0  0.0  NaN